/**
  ******************************************************************************
  * 
  * @file      FLASH.c
  * 
  * @brief     Надаппаратный драйвер FLASH.
  * 
  * @details   Функции для работы с FLASH.
  *
  * @warning   **ВАЖНО!**                                                                                                     \n 
  * Для работы драйвера требуется аппаратный драйвер flash для конкретного микроконтроллера. Например:
  *                       + файл at32f413_flash.c - аппаратный драйвер работы с flash от Artery;
  *                       + файл at32f413_flash.h - header for at32f413_flash.c.
  *
  * **Manual** \n 
  * В драйвере реализованы следующие функции:
  * - Write_Config_to_flash (uint32_t *Data) - запись во FLASH изменяемых параметров модуля Config Page.                      \n 
  *   Изменяемые параметры модуля могут храниться в структуре типа uint32_t или типа Config_struct.                           \n 
  *   Начальныый адрес для записи/чтения изменяемых параметров модуля во/из FLASH определён макросом ADDR_CONFIG_PAGE.
  *
  * - Read_Config_from_flash (Config_struct* Config) - чтение изменяемых параметров модуля из FLASH                           \n 
  *   в структуру типа Config_struct.
  *   
  * - Read_RO_Constants_from_flash (RO_Constants_struct* RO_Constants) - чтение неизменяемых параметров модуля                \n 
  *   в структуру типа RO_Constants_struct.
  *
  * - Write_Words_to_flash (uint32_t Address, uint32_t Amount, uint32_t *Words) - запись во FLASH произвольного массива слов. \n 
  *
  *
  * Config Page  - область хранения изменяемых параметров модуля.                                                             \n
  * RO Constants - область хранения неизменяемых параметров модуля (записывается при сборке модуля).                          \n
  * \n 
  *
  * **Карта памяти Config Page**
  * Параметр                        | Адрес      | 0x00 | 0x01 | 0x02 | 0x03
  * ------------------------------- | ---------- | ---- | ---- | ---- | ---- 
  * Адрес модуля                    | 0x0801F000 | addr | 0xFF | 0xFF | 0xFF
  * Версия загрузчика               | 0x0801F004 | minor| major| 0xFF | 0xFF
  * Версия программы                | 0x0801F008 | minor| major| 0xFF | 0xFF
  * Флаг первого запуска            | 0x0801F00C | flag | 0xFF | 0xFF | 0xFF
  * Не используется в модуле Modbus | 0x0801F010 | 0xFF | 0xFF | 0xFF | 0xFF
  * Параметры Modbus порта 0        | 0x0801F014 | baud | par  | stop | 0xFF
  * Параметры Modbus порта 1        | 0x0801F018 | baud | par  | stop | 0xFF
  * Параметры Modbus порта 2        | 0x0801F01C | baud | par  | stop | 0xFF
  * Параметры Modbus порта 3        | 0x0801F020 | baud | par  | stop | 0xFF
  * Страница Config Page содержит параметры модуля, записанные в виде 32-битных слов.
  * \n \n 
  *
  * **Карта памяти RO Constants**
  * Параметр             | Адрес      | 0x00  | 0x01  | 0x02 | 0x03
  * -------------------- | ---------- | ----- | ----- | ---- | ---- 
  * Тип модуля           | 0x0801F800 | class | 0xFF  | 0xFF | 0xFF
  * Аппаратная ревизия   | 0x0801F804 | minor | major | 0xFF | 0xFF
  * Серийный номер lw    | 0x0801F808 | 0xFF  | 0xFF  | 0xFF | 0xFF
  * Серийный номер hw    | 0x0801F810 | 0xFF  | 0xFF  | 0xFF | 0xFF
  *
  * Страница RO Constants содержит параметры модуля, записанные в виде 32-битных слов.
  * \n \n 
  *
  * @copyright Copyright (C) 2022 Awada Systems. Все права защищены.
  *
  * @author    Larionov A.S. (larion.alex@mail.ru)
  * 
  ******************************************************************************
**/

//---Includes-------------------------------------------------------------------//
#include "FLASH.h"
//------------------------------------------------------------------------------//

//---Private macros-------------------------------------------------------------//
//------------------------------------------------------------------------------//

//---Exported variables---------------------------------------------------------//
//------------------------------------------------------------------------------//

//---Private types--------------------------------------------------------------//
//------------------------------------------------------------------------------//

//---Private variables----------------------------------------------------------//
//------------------------------------------------------------------------------//

//---Private constants----------------------------------------------------------//
//------------------------------------------------------------------------------//

//---Function prototypes--------------------------------------------------------//
//------------------------------------------------------------------------------//

//---Exported functions---------------------------------------------------------//
/**
  * @brief   Запись Config во FLASH.
  * @param   Data - указатель типа uint32_t* на структуру с данными Config.
  * @return  flash status.
  */
__weak flash_status Write_Config_to_flash (uint32_t *Data)
{
return FLASH_ERROR;
}
//------------------------------------------------------------------------------//


/**
  * @brief   Чтение Config из FLASH.
  * @param   Data - указатель типа uint32_t* на структуру с данными Config.
  * @return  None.
  */
__weak void Read_Config_from_flash (Config_struct* Config)
{
;
}
//------------------------------------------------------------------------------//


/**
  * @brief   Чтение RO_Constants из FLASH.
  * @param   RO_Constants - указатель типа RO_Constants_struct* на структуру с данными RO_Constants.
  * @return  None.
  */
__weak void Read_RO_Constants_from_flash (RO_Constants_struct* RO_Constants)
{
;
}
//------------------------------------------------------------------------------//


/**
  * @brief   Запись массива данных во FLASH.
  * @details Функция записи массива слов во FLASH.
  * @param   Address - адрес начальной ячейки.
  * @param   Amount  - количество записываемых слов.
  * @param   Words   - указатель типа uint32_t* на массив с данными. Данные должны быть выровнены по 4 байта.
  * @return  flash status.
  */
__weak flash_status Write_Words_to_flash (uint32_t Address, uint32_t Amount, uint32_t *Words)
{
return FLASH_ERROR;
}
//------------------------------------------------------------------------------//


//---Private functions----------------------------------------------------------//
//------------------------------------------------------------------------------//


//***************************************END OF FILE**************************************//
